InformationRegisters/ЗначенияЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Атрибуты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеЭлементаКонструктораВидовПродукцииИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияЭлементовКонструктораВидовПродукцииИС/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ПрочитатьУстановитьПараметры();
	
	Если Не Параметры.Свойство("РежимРазработчика") Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не Параметризуется Тогда
		ТекущийОбъект.Значение = Неопределено;
	КонецЕсли;
	
	Если ИспользоватьАтрибуты Тогда
		ТекущиеАтрибуты = Новый Структура;
		Для Каждого Строка Из Атрибуты Цикл
			ТекущиеАтрибуты.Вставить(Строка.Атрибут, Строка.Значение);
		КонецЦикла;
	Иначе
		ТекущиеАтрибуты = Неопределено;
	КонецЕсли;
	
	ТекущийОбъект.Атрибуты = Новый ХранилищеЗначения(ТекущиеАтрибуты);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Параметризуется
		И Не ЗначениеЗаполнено(Запись.Значение) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Поле ""Значение"" не заполнено'"),,,
			"Запись.Значение", Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЭлементКонструктораПриИзменении(Элемент)
	
	ПрочитатьУстановитьПараметры();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыАтрибуты

&НаКлиенте
Процедура АтрибутыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Атрибуты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.АтрибутыЗначение.ОграничениеТипа = АтрибутыЭлементаКонструктора[ТекущиеДанные.Атрибут];
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	Для Каждого КлючИЗначение Из АтрибутыЭлементаКонструктора Цикл
		Если КлючИЗначение.Значение.Типы().Найти(Тип("Дата")) <> Неопределено
			И КлючИЗначение.Значение.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Дата Тогда
			
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			
			ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.АтрибутыЗначение.Имя);
			
			ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(Элементы.АтрибутыАтрибут.ПутьКДанным);
			ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ОтборЭлемента.ПравоеЗначение = КлючИЗначение.Ключ;
			
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Формат", "ДФ=dd.MM.yyyy;");
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьВидимостьЭлементовФормы()
	
	Элементы.Значение.Видимость = Параметризуется;
	Элементы.Значение.АвтоОтметкаНезаполненного = Параметризуется;
	
	Элементы.Атрибуты.Видимость = ИспользоватьАтрибуты;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьУстановитьПараметры()
	
	ПараметрыЭлемента = Справочники.ЭлементыКонструктораВидовПродукцииИС.ПараметрыЭлементаКонструктора(Запись.ЭлементКонструктора);
	
	Параметризуется = ПараметрыЭлемента.Параметризуется;
	ИспользоватьАтрибуты = ПараметрыЭлемента.ИспользоватьАтрибуты;
	АтрибутыЭлементаКонструктора = ПараметрыЭлемента.Атрибуты;
	
	ЗаполнитьАтрибуты();
	
	Элементы.Значение.ОграничениеТипа = ПараметрыЭлемента.ТипЗначения;
	
	Если Параметризуется
		И ПараметрыЭлемента.ТипЗначения.Типы().Найти(Тип("Дата")) <> Неопределено
		И ПараметрыЭлемента.ТипЗначения.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Дата Тогда
		Элементы.Значение.Формат = "ДФ=dd.MM.yyyy;";
		Элементы.Значение.ФорматРедактирования = "ДФ=dd.MM.yyyy;";
	КонецЕсли;
	
	УстановитьДоступностьВидимостьЭлементовФормы();
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАтрибуты()
	
	Атрибуты.Очистить();
	
	Если Не ИспользоватьАтрибуты Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеАтрибуты = ТекущиеАтрибуты();
	
	Для Каждого КлючИЗначение Из АтрибутыЭлементаКонструктора Цикл
		Строка = Атрибуты.Добавить();
		Строка.Атрибут = КлючИЗначение.Ключ;
		Строка.Представление = ОбщегоНазначенияИСКлиентСервер.ПредставлениеВстроенногоИмени(Строка.Атрибут);
		Если ТекущиеАтрибуты.Свойство(КлючИЗначение.Ключ) Тогда
			Строка.Значение = ТекущиеАтрибуты[КлючИЗначение.Ключ];
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ТекущиеАтрибуты()
	
	Результат = Новый Структура;
	
	Если ЗначениеЗаполнено(Запись.ИсходныйКлючЗаписи.ЭлементКонструктора) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЭлементКонструктора", Запись.ИсходныйКлючЗаписи.ЭлементКонструктора);
		Запрос.УстановитьПараметр("ВидПродукции", Запись.ИсходныйКлючЗаписи.ВидПродукции);
		Запрос.УстановитьПараметр("Значение", Запись.ИсходныйКлючЗаписи.Значение);
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗначенияЭлементовКонструктораВидовПродукцииИС.Атрибуты
		|ИЗ
		|	РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС КАК ЗначенияЭлементовКонструктораВидовПродукцииИС
		|ГДЕ
		|	ЗначенияЭлементовКонструктораВидовПродукцииИС.ЭлементКонструктора = &ЭлементКонструктора
		|	И ЗначенияЭлементовКонструктораВидовПродукцииИС.ВидПродукции = &ВидПродукции
		|	И ЗначенияЭлементовКонструктораВидовПродукцииИС.Значение = &Значение";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ТекущиеАтрибуты = Выборка.Атрибуты.Получить();
			Если ТипЗнч(ТекущиеАтрибуты) = Тип("Структура") Тогда
				Результат = ТекущиеАтрибуты;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
